# Check Data

In [10]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

## Check DataFrame
Calculate all possible calculation

In [11]:
df.describe()

           height     English        Math  Science
count    4.000000    4.000000    4.000000     4.00
mean   158.750000   92.500000   91.000000    94.25
std     20.790623    9.882645    9.831921     4.50
min    130.000000   78.000000   78.000000    88.00
25%    150.250000   90.750000   86.250000    92.50
50%    165.000000   96.000000   93.000000    95.50
75%    173.500000   97.750000   97.750000    97.25
max    175.000000  100.000000  100.000000    98.00

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1st to 4th
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   school    4 non-null      object
 2   height    4 non-null      int64
 3   English   4 non-null      int64
 4   Math      4 non-null      int64
 5   Science   4 non-null      int64
 6   SWskills  4 non-null      object
dtypes: int64(4), object(3)
memory usage: 256.0+ bytes

In [15]:
df.head() # bring first 5 row

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [17]:
df.head(7) # bring first 7 row

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [18]:
df.tail() # bring last 5 row

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [19]:
df.values

array([['Sally', 'Biola', 157, 97, 89, 88, 'C++'],
       ['David', 'UCI', 173, 78, 100, 98, 'Python'],
       ['Daniel', 'Navy', 175, 95, 78, 94, 'Java'],
       ['Peter', 'Emery', 130, 100, 97, 97, 'Swift']], dtype=object)

In [20]:
df.index

Index(['1st', '2nd', '3rd', '4th'], dtype='object', name='Sib. #')

In [21]:
df.index

Index(['1st', '2nd', '3rd', '4th'], dtype='object', name='Sib. #')

In [23]:
df.shape # show row, column

(4, 7)

## Check Series

In [25]:
df['height'].describe()

count      4.000000
mean     158.750000
std       20.790623
min      130.000000
25%      150.250000
50%      165.000000
75%      173.500000
max      175.000000
Name: height, dtype: float64

In [26]:
df['height'].min()

130

In [27]:
df['height'].max()

175

In [28]:
df['height'].nlargest(3) # 3 largest heights

Sib. #
3rd    175
2nd    173
1st    157
Name: height, dtype: int64

In [29]:
df['height'].mean()

158.75

In [30]:
df['height'].sum()

635

In [31]:
df['height'].count()

4

In [33]:
df['height'].unique() # bring things & merge duplicates

array([157, 173, 175, 130])

In [34]:
df['height'].nunique() # count unique

4